OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f13k50.h
#define _PORTB_RB4              0x10
#define _PORTB_SDI              0x10
#define _PORTB_SDA              0x10
#define _PORTB_AN10             0x10
#define _PORTB_RB5              0x20
#define _PORTB_RX               0x20
#define _PORTB_AN11             0x20
#define _PORTB_RB6              0x40
#define _PORTB_SCL              0x40
#define _PORTB_SCK              0x40
#define _PORTB_RB7              0x80
#define _PORTB_TX               0x80
#define _PORTB_CK               0x80

//==============================================================================


//==============================================================================
//        PORTC Bits

extern __at(0x0F82) __sfr PORTC;

typedef union
  {
  struct
    {
    unsigned RC0                : 1;
    unsigned RC1                : 1;
    unsigned RC2                : 1;
    unsigned RC3                : 1;
    unsigned RC4                : 1;
    unsigned RC5                : 1;
    unsigned RC6                : 1;
    unsigned RC7                : 1;
    };

  struct
    {
    unsigned AN4                : 1;
    unsigned AN5                : 1;
    unsigned AN6                : 1;
    unsigned AN7                : 1;
    unsigned C12OUT             : 1;
    unsigned CCP1               : 1;
    unsigned AN8                : 1;
    unsigned AN9                : 1;
    };

  struct
    {
    unsigned C12INP             : 1;
    unsigned C12IN1M            : 1;
    unsigned C12IN2M            : 1;
    unsigned C12IN3M            : 1;
    unsigned SRQ                : 1;
    unsigned T0CKI              : 1;
    unsigned NOT_SS             : 1;
    unsigned T1OSCO             : 1;
    };

  struct
    {
    unsigned INT0               : 1;
    unsigned INT1               : 1;
    unsigned INT2               : 1;
    unsigned PGM                : 1;
    unsigned P1B                : 1;
    unsigned P1A                : 1;
    unsigned T13CKI             : 1;
    unsigned SDO                : 1;
    };

  struct
    {
    unsigned VREFP              : 1;
    unsigned VREFM              : 1;
    unsigned CVREF              : 1;
    unsigned P1C                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T1OSCI             : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned P1D                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned SS                 : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned INT                : 3;
    unsigned                    : 5;
    };
  } __PORTCbits_t;

extern __at(0x0F82) volatile __PORTCbits_t PORTCbits;

#define _PORTC_RC0              0x01
#define _PORTC_AN4              0x01
#define _PORTC_C12INP           0x01
#define _PORTC_INT0             0x01
#define _PORTC_VREFP            0x01
#define _PORTC_RC1              0x02
#define _PORTC_AN5              0x02
#define _PORTC_C12IN1M          0x02
#define _PORTC_INT1             0x02
#define _PORTC_VREFM            0x02
#define _PORTC_RC2              0x04
#define _PORTC_AN6              0x04
#define _PORTC_C12IN2M          0x04
#define _PORTC_INT2             0x04
#define _PORTC_CVREF            0x04
#define _PORTC_P1D              0x04
#define _PORTC_RC3              0x08
#define _PORTC_AN7              0x08
#define _PORTC_C12IN3M          0x08
#define _PORTC_PGM              0x08
#define _PORTC_P1C              0x08
#define _PORTC_RC4              0x10
#define _PORTC_C12OUT           0x10
#define _PORTC_SRQ              0x10
#define _PORTC_P1B              0x10
#define _PORTC_RC5              0x20
#define _PORTC_CCP1             0x20
#define _PORTC_T0CKI            0x20
#define _PORTC_P1A              0x20
#define _PORTC_RC6              0x40
#define _PORTC_AN8              0x40
#define _PORTC_NOT_SS           0x40
#define _PORTC_T13CKI           0x40
#define _PORTC_T1OSCI           0x40
#define _PORTC_SS               0x40
#define _PORTC_RC7              0x80
#define _PORTC_AN9              0x80
#define _PORTC_T1OSCO           0x80
#define _PORTC_SDO              0x80

//==============================================================================


//==============================================================================
//        LATA Bits

extern __at(0x0F89) __sfr LATA;

typedef struct
  {
  unsigned LATA0                : 1;
  unsigned LATA1                : 1;
  unsigned                      : 1;
  unsigned LATA3                : 1;
  unsigned LATA4                : 1;
  unsigned LATA5                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __LATAbits_t;

extern __at(0x0F89) volatile __LATAbits_t LATAbits;

#define _LATA0                  0x01
#define _LATA1                  0x02
#define _LATA3                  0x08
#define _LATA4                  0x10
#define _LATA5                  0x20

//==============================================================================


//==============================================================================
//        LATB Bits

extern __at(0x0F8A) __sfr LATB;

typedef struct
  {
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned LATB4                : 1;
  unsigned LATB5                : 1;
  unsigned LATB6                : 1;
  unsigned LATB7                : 1;
  } __LATBbits_t;

extern __at(0x0F8A) volatile __LATBbits_t LATBbits;

#define _LATB4                  0x10
#define _LATB5                  0x20
#define _LATB6                  0x40
#define _LATB7                  0x80

//==============================================================================


//==============================================================================
//        LATC Bits

extern __at(0x0F8B) __sfr LATC;

typedef struct
  {
  unsigned LATC0                : 1;
  unsigned LATC1                : 1;
  unsigned LATC2                : 1;
  unsigned LATC3                : 1;
  unsigned LATC4                : 1;
  unsigned LATC5                : 1;
  unsigned LATC6                : 1;
  unsigned LATC7                : 1;
  } __LATCbits_t;

extern __at(0x0F8B) volatile __LATCbits_t LATCbits;

#define _LATC0                  0x01
#define _LATC1                  0x02
#define _LATC2                  0x04
#define _LATC3                  0x08
#define _LATC4                  0x10
#define _LATC5                  0x20
#define _LATC6                  0x40
#define _LATC7                  0x80

//==============================================================================


//==============================================================================
//        DDRA Bits

extern __at(0x0F92) __sfr DDRA;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned TRISA4             : 1;
    unsigned TRISA5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned RA4                : 1;
    unsigned RA5                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __DDRAbits_t;

extern __at(0x0F92) volatile __DDRAbits_t DDRAbits;

#define _TRISA4                 0x10
#define _RA4                    0x10
#define _TRISA5                 0x20
#define _RA5                    0x20

//==============================================================================


//==============================================================================
//        TRISA Bits

extern __at(0x0F92) __sfr TRISA;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned TRISA4             : 1;
    unsigned TRISA5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned RA4                : 1;
    unsigned RA5                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __TRISAbits_t;

extern __at(0x0F92) volatile __TRISAbits_t TRISAbits;

